; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	spectrograph3 - mode
	infrared0 - mode
	infrared2 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation2 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star5)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared2)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(pointing satellite1 Star5)
	(have_image Planet6 thermograph1)
	(have_image Phenomenon7 infrared0)
	(have_image Planet8 spectrograph3)
	(have_image Star9 thermograph1)
	(have_image Planet10 infrared2)
	(have_image Star11 spectrograph3)
	(have_image Phenomenon12 spectrograph3)
	(have_image Phenomenon13 spectrograph3)
))

)

; plan
1. (turn_to satellite1 groundstation2 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 9
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite1 planet10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet10)
   goals met: 0 of 9
5. (take_image satellite1 planet10 instrument3 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon7 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 9
7. (turn_to satellite0 star4 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star4)
   goals met: 1 of 9
8. (take_image satellite1 phenomenon7 instrument3 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 2 of 9
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 9
10. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 2 of 9
11. (turn_to satellite0 phenomenon12 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 9
12. (take_image satellite0 phenomenon12 instrument0 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 3 of 9
13. (turn_to satellite0 phenomenon13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 9
14. (take_image satellite0 phenomenon13 instrument0 spectrograph3)
   added: (have_image phenomenon13 spectrograph3)
   goals met: 4 of 9
15. (turn_to satellite0 planet8 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet8)
   goals met: 4 of 9
16. (take_image satellite0 planet8 instrument0 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 5 of 9
17. (turn_to satellite0 star11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star11)
   goals met: 5 of 9
18. (take_image satellite0 star11 instrument0 spectrograph3)
   added: (have_image star11 spectrograph3)
   goals met: 6 of 9
19. (turn_to satellite1 planet6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet6)
   goals met: 6 of 9
20. (take_image satellite1 planet6 instrument3 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 7 of 9
21. (turn_to satellite1 star9 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star9)
   goals met: 7 of 9
22. (take_image satellite1 star9 instrument3 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 8 of 9
23. (turn_to satellite1 star5 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star5)
   goals met: 9 of 9
